app/views/product_categories/show.html.erb

          <div class="thumbnail">
            <%= image_tag(p.product_images.first.image(:thumb)) unless p.product_images.empty? %>
---
SELECT COUNT(*) FROM `product_images` WHERE `product_images`.`product_id` = 2
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 2 LIMIT 1
SELECT `products`.* FROM `products` WHERE (product_category_id IN(6,7,5))