app/controllers/home_controller.rb

SELECT `main_sliders`.* FROM `main_sliders`
---
  def index
#    @users = User.all
    @main_sliders = MainSlider.all