app/controllers/main_sliders_controller.rb

  def index
    @main_sliders = MainSlider.all
---
SELECT `main_sliders`.* FROM `main_sliders`

  def destroy
    @main_slider = MainSlider.find(params[:id])

    if @main_slider.destroy
---
SELECT `main_sliders`.* FROM `main_sliders` WHERE `main_sliders`.`id` = 3 LIMIT 1
DELETE FROM `main_sliders` WHERE `main_sliders`.`id` = 3