app/controllers/product_images_controller.rb

SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`id` = 4 LIMIT 1
DELETE FROM `product_images` WHERE `product_images`.`id` = 4
---
  def destroy
    @product_image = ProductImage.find(params[:id])
    product = @product_image.product
    if @product_image.destroy